import { supabaseUrl } from "../services/supabase";

const imageUrl = `${supabaseUrl}/storage/v1/object/public/cabin-images/`;

export const cabins = [
  {
    name: "001",
    maxCapacity: 2,
    regularPrice: 250,
    discount: 0,
    image: imageUrl + "cabin-001.jpg",
    description:
      "کابین 001 برای زوج‌ها مناسب است. فضای داخل کابین راحت و دنج است، با اتاق نشیمن، شومینه و آشپزخانه مجهز. تخت بزرگ و نرم برای یک خواب آرام آماده است. حمام با دوش شبیه اسپا و تراس خصوصی با جکوزی برای استراحت و لذت بردن از طبیعت موجود است.",
  },
  {
    name: "002",
    maxCapacity: 2,
    regularPrice: 350,
    discount: 25,
    image: imageUrl + "cabin-002.jpg",
    description:
      "کابین 002 نیز مناسب زوج‌هاست و در دل طبیعت قرار دارد. فضای داخلی راحت و گرم است، با اتاق نشیمن، شومینه و آشپزخانه کامل. تخت بزرگ و حمام شبیه اسپا راحتی شما را تضمین می‌کند. تراس خصوصی با جکوزی برای لذت بردن از طبیعت فراهم است.",
  },
  {
    name: "003",
    maxCapacity: 4,
    regularPrice: 300,
    discount: 0,
    image: imageUrl + "cabin-003.jpg",
    description:
      "کابین 003 برای خانواده‌های تا 4 نفر مناسب است. فضای داخلی راحت با اتاق نشیمن، شومینه و آشپزخانه مجهز دارد. اتاق‌ها با تخت‌های راحت و حمام اختصاصی آماده‌اند. تراس خصوصی با جکوزی و فضای نشستن بیرونی برای لذت بردن از طبیعت فراهم است.",
  },
  {
    name: "004",
    maxCapacity: 4,
    regularPrice: 500,
    discount: 50,
    image: imageUrl + "cabin-004.jpg",
    description:
      "کابین 004 برای خانواده‌های تا 4 نفر طراحی شده و امکانات کامل و راحتی بالایی دارد. داخل کابین اتاق نشیمن، شومینه و آشپزخانه مجهز موجود است. اتاق‌ها با تخت‌های نرم و حمام اختصاصی شبیه اسپا تجهیز شده‌اند. تراس خصوصی و جکوزی برای استراحت و لذت بردن از محیط طبیعی آماده است.",
  },
  {
    name: "005",
    maxCapacity: 6,
    regularPrice: 350,
    discount: 0,
    image: imageUrl + "cabin-005.jpg",
    description:
      "کابین 005 برای گروه‌ها یا خانواده‌های تا 6 نفر مناسب است. فضای داخلی دنج با اتاق نشیمن، شومینه و آشپزخانه مجهز دارد. اتاق‌ها راحت و دارای حمام اختصاصی هستند. تراس خصوصی با جکوزی برای استراحت و لذت بردن از محیط طبیعی فراهم شده است.",
  },
  {
    name: "006",
    maxCapacity: 6,
    regularPrice: 800,
    discount: 100,
    image: imageUrl + "cabin-006.jpg",
    description:
      "کابین 006 برای گروه‌ها یا خانواده‌های تا 6 نفر طراحی شده و امکانات لوکس و راحتی بالایی دارد. داخل کابین اتاق نشیمن بزرگ، شومینه و آشپزخانه مجهز وجود دارد. اتاق‌ها با تخت‌های راحت و حمام اختصاصی شبیه اسپا آماده‌اند. تراس خصوصی و جکوزی برای استراحت و لذت بردن از طبیعت فراهم است.",
  },
  {
    name: "007",
    maxCapacity: 8,
    regularPrice: 600,
    discount: 100,
    image: imageUrl + "cabin-007.jpg",
    description:
      "کابین 007 مناسب گروه‌های بزرگ یا چند خانواده است و فضای وسیع و راحتی دارد. داخل کابین اتاق نشیمن، شومینه و آشپزخانه مجهز موجود است. اتاق‌ها راحت و دارای حمام اختصاصی هستند. تراس خصوصی با جکوزی و فضای نشستن بیرونی برای لذت بردن از محیط طبیعی آماده است.",
  },
  {
    name: "008",
    maxCapacity: 10,
    regularPrice: 1400,
    discount: 0,
    image: imageUrl + "cabin-008.jpg",
    description:
      "کابین 008 مناسب گروه‌های بزرگ یا چند خانواده است و امکانات لوکس و کامل دارد. داخل کابین چندین اتاق نشیمن با شومینه، سالن ناهارخوری و آشپزخانه مجهز فراهم است. اتاق‌ها با تخت‌های راحت و حمام اختصاصی شبیه اسپا تجهیز شده‌اند. تراس خصوصی با جکوزی و فضای نشستن کافی برای استراحت و لذت بردن از طبیعت آماده است.",
  },
];
